driver-tests/bpelse/xpathfunctions/XPathFunctionsJbi/test/xsdAnychildNodeAccess/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:val="http://xml.netbeans.org/schema/validatorSchema" xmlns:urn="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:urn1="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:urn2="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
  <soapenv:Body>
    <val:PartElement>
      <val:AnyXML>
    <urn:AdhocQueryRequest>
      <urn:ResponseOption returnType="LeafClass" returnComposedObjects="true"/>
      <urn2:AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
        <urn2:Slot name="$XDSDocumentEntryPatientId">
          <urn2:ValueList>
            <urn2:Value>'1.19.6.24.109.42.1.1^^^1.3.6.1.4.1.21367.2005.3.7ISO'</urn2:Value>
          </urn2:ValueList>
        </urn2:Slot>
        <urn2:Slot name="$XDSDocumentEntryStatus">
          <urn2:ValueList>
            <urn2:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</urn2:Value>
          </urn2:ValueList>
        </urn2:Slot>
      </urn2:AdhocQuery>
    </urn:AdhocQueryRequest>
        <AnyElement/>
      </val:AnyXML>
    </val:PartElement>
  </soapenv:Body>
</soapenv:Envelope>